#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_s3_bucket.bucket["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.github.github_repository.example: Refreshing state... [id=terraform-example]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["mind"]: Refreshing state... [id=config/e4:5f:01:27:c8:af.yaml]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["soul"]: Refreshing state... [id=config/e4:5f:01:05:41:72.yaml]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_iam_user.user["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-335be9c5595a4d85e1bf191c172718e4]
module.synology.module.minio.minio_iam_policy.policy_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-335be9c5595a4d85e1bf191c172718e4]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-954ebc35ecca52a899c98bdd9c1762fe]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-705433c3614c5093ab5aabd268719e88]
module.synology.module.minio.minio_iam_policy.policy["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-03c3c71cc85e3193397f03bdcc2c24cf]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-335be9c5595a4d85e1bf191c172718e4]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20210927171409029700000003]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20210927172846919500000002]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20210927171409026600000001]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20210927172846919500000003]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-20210927171409027800000002]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-20210927172846917600000001]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment" {
        id          = "state-infinity-gauntlet-longhorn-20210927171409027800000002"
      ~ policy_name = "state-infinity-gauntlet-longhorn-954ebc35ecca52a899c98bdd9c1762fe" -> "state-infinity-gauntlet-longhorn-335be9c5595a4d85e1bf191c172718e4"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
        id          = "tftp-netboot-infinity-gauntlet-20210927171409026600000001"
      ~ policy_name = "tftp-netboot-infinity-gauntlet-335be9c5595a4d85e1bf191c172718e4" -> "tftp-netboot-infinity-gauntlet-03c3c71cc85e3193397f03bdcc2c24cf"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
        id          = "state-infinity-gauntlet-etcd-20210927171409029700000003"
      ~ policy_name = "state-infinity-gauntlet-etcd-335be9c5595a4d85e1bf191c172718e4" -> "state-infinity-gauntlet-etcd-705433c3614c5093ab5aabd268719e88"
        # (1 unchanged attribute hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.github.github_repository.example will be updated in-place
  ~ resource "github_repository" "example" {
      ~ description            = "My awesome terraform example a5d52bd815458a4cd49961b04d367ed9" -> (known after apply)
        id                     = "terraform-example"
        name                   = "terraform-example"
        # (23 unchanged attributes hidden)
    }

  # module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_policy" "policy" {
      ~ id     = "state-infinity-gauntlet-etcd-705433c3614c5093ab5aabd268719e88" -> (known after apply)
      ~ name   = "state-infinity-gauntlet-etcd-705433c3614c5093ab5aabd268719e88" -> "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" # forces replacement
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:*",
                        ] -> "s3:*"
                      ~ Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-etcd",
                            "arn:aws:s3:::state-infinity-gauntlet-etcd/*",
                          + "arn:aws:s3:::state-infinity-gauntlet-etcd",
                        ]
                      + Sid      = ""
                        # (1 unchanged element hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }

  # module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_longhorn"] must be replaced
-/+ resource "minio_iam_policy" "policy" {
      ~ id     = "state-infinity-gauntlet-longhorn-954ebc35ecca52a899c98bdd9c1762fe" -> (known after apply)
      ~ name   = "state-infinity-gauntlet-longhorn-954ebc35ecca52a899c98bdd9c1762fe" -> "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" # forces replacement
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:*",
                        ] -> "s3:*"
                      ~ Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-longhorn",
                            "arn:aws:s3:::state-infinity-gauntlet-longhorn/*",
                          + "arn:aws:s3:::state-infinity-gauntlet-longhorn",
                        ]
                      + Sid      = ""
                        # (1 unchanged element hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }

  # module.synology.module.minio.minio_iam_policy.policy["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_policy" "policy" {
      ~ id     = "tftp-netboot-infinity-gauntlet-03c3c71cc85e3193397f03bdcc2c24cf" -> (known after apply)
      ~ name   = "tftp-netboot-infinity-gauntlet-03c3c71cc85e3193397f03bdcc2c24cf" -> "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" # forces replacement
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:*",
                        ] -> "s3:*"
                      ~ Resource = [
                          - "arn:aws:s3:::tftp-netboot-infinity-gauntlet",
                            "arn:aws:s3:::tftp-netboot-infinity-gauntlet/*",
                          + "arn:aws:s3:::tftp-netboot-infinity-gauntlet",
                        ]
                      + Sid      = ""
                        # (1 unchanged element hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }

  # module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_policy" "policy_global" {
      ~ id     = "state-infinity-gauntlet-etcd-335be9c5595a4d85e1bf191c172718e4" -> (known after apply)
      ~ name   = "state-infinity-gauntlet-etcd-335be9c5595a4d85e1bf191c172718e4" -> "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b" # forces replacement
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:GetBucketLocation",
                            "s3:ListAllMyBuckets",
                          + "s3:GetBucketLocation",
                        ]
                      ~ Resource = [
                          - "arn:aws:s3:::*",
                        ] -> "arn:aws:s3:::*"
                      + Sid      = ""
                        # (1 unchanged element hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }

  # module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_longhorn"] must be replaced
-/+ resource "minio_iam_policy" "policy_global" {
      ~ id     = "state-infinity-gauntlet-longhorn-335be9c5595a4d85e1bf191c172718e4" -> (known after apply)
      ~ name   = "state-infinity-gauntlet-longhorn-335be9c5595a4d85e1bf191c172718e4" -> "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b" # forces replacement
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:GetBucketLocation",
                            "s3:ListAllMyBuckets",
                          + "s3:GetBucketLocation",
                        ]
                      ~ Resource = [
                          - "arn:aws:s3:::*",
                        ] -> "arn:aws:s3:::*"
                      + Sid      = ""
                        # (1 unchanged element hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }

  # module.synology.module.minio.minio_iam_policy.policy_global["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_policy" "policy_global" {
      ~ id     = "tftp-netboot-infinity-gauntlet-335be9c5595a4d85e1bf191c172718e4" -> (known after apply)
      ~ name   = "tftp-netboot-infinity-gauntlet-335be9c5595a4d85e1bf191c172718e4" -> "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b" # forces replacement
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:GetBucketLocation",
                            "s3:ListAllMyBuckets",
                          + "s3:GetBucketLocation",
                        ]
                      ~ Resource = [
                          - "arn:aws:s3:::*",
                        ] -> "arn:aws:s3:::*"
                      + Sid      = ""
                        # (1 unchanged element hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "state-infinity-gauntlet-etcd-20210927172846919500000002" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-etcd-705433c3614c5093ab5aabd268719e88" -> "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "state-infinity-gauntlet-longhorn-20210927171409027800000002" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-longhorn-335be9c5595a4d85e1bf191c172718e4" -> "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "tftp-netboot-infinity-gauntlet-20210927172846919500000003" -> (known after apply)
      ~ policy_name = "tftp-netboot-infinity-gauntlet-03c3c71cc85e3193397f03bdcc2c24cf" -> "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "state-infinity-gauntlet-etcd-20210927171409029700000003" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-etcd-705433c3614c5093ab5aabd268719e88" -> "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_longhorn"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "state-infinity-gauntlet-longhorn-20210927172846917600000001" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-longhorn-335be9c5595a4d85e1bf191c172718e4" -> "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "tftp-netboot-infinity-gauntlet-20210927171409026600000001" -> (known after apply)
      ~ policy_name = "tftp-netboot-infinity-gauntlet-03c3c71cc85e3193397f03bdcc2c24cf" -> "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["mind"] will be destroyed
  - resource "minio_s3_object" "node_k3os_config" {
      - bucket_name = "tftp-netboot-infinity-gauntlet" -> null
      - content     = <<-EOT
            "hostname": "mind.infinity-gauntlet.k8s.home.wyrihaxim.us"
            "k3os":
              "dns_nameservers":
              - "192.168.1.3"
              "k3s_args":
              - "server"
              - "--cluster-init"
              - "--cluster-reset"
              - "--disable traefik"
              - "--etcd-snapshot-schedule-cron=\"*/3 * * * *\""
              - "--etcd-s3"
              - "--etcd-s3-endpoint=http://192.168.1.2:9099"
              - "--etcd-s3-bucket=state-infinity-gauntlet-etcd"
              - "--etcd-s3-region=main"
              - "--cluster-reset-restore-path=etc.state"
              - "--etcd-s3-access-key=state-infinity-gauntlet-etcd"
              - "--etcd-s3-secret-key=kEX9BcUvHE4xz78Ta7Dh8KuwgaBbMu83N5Nx9Hz"
              - "--flannel-iface=eth0"
              "labels":
                "arch": "arm64"
                "infinity-stone": "mind"
                "region": "zolder"
              "modules":
              - "kvm"
              - "nvme"
              "ntp_servers":
              - "0.us.pool.ntp.org"
              - "1.us.pool.ntp.org"
              "token": "SnaHEaYvPjTdyEyr8m9ZRbWavP3WDAENYA2j2RRk8uhhTu6Sz3pFf3x5Gn8G9YtJGxpH8tyc6QycsSHK9FzsJRDJHLSzEkaULNt8DBqPk2E5nHvMPKUxau5Tqj7YLcDh"
              "wifi":
              - "name": "Subspace"
                "passphrase": "a3rfa23raq23ta243wefgwe"
            "ssh_authorized_keys":
            - "github:wyrihaximus"
        EOT -> null
      - etag        = "7db90f73032885c907fcc7280099f3ef-1" -> null
      - id          = "config/e4:5f:01:27:c8:af.yaml" -> null
      - object_name = "config/e4:5f:01:27:c8:af.yaml" -> null
    }

  # module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["soul"] will be destroyed
  - resource "minio_s3_object" "node_k3os_config" {
      - bucket_name = "tftp-netboot-infinity-gauntlet" -> null
      - content     = <<-EOT
            "hostname": "soul.infinity-gauntlet.k8s.home.wyrihaxim.us"
            "k3os":
              "dns_nameservers":
              - "192.168.1.3"
              "k3s_args":
              - "agent"
              - "--server https://mind.infinity-gauntlet.k8s.home.wyrihaxim.us:6443"
              - "--flannel-iface=eth0"
              "labels":
                "arch": "arm64"
                "infinity-stone": "soul"
                "region": "zolder"
              "modules":
              - "kvm"
              - "nvme"
              "ntp_servers":
              - "0.us.pool.ntp.org"
              - "1.us.pool.ntp.org"
              "token": "SnaHEaYvPjTdyEyr8m9ZRbWavP3WDAENYA2j2RRk8uhhTu6Sz3pFf3x5Gn8G9YtJGxpH8tyc6QycsSHK9FzsJRDJHLSzEkaULNt8DBqPk2E5nHvMPKUxau5Tqj7YLcDh"
              "wifi":
              - "name": "Subspace"
                "passphrase": "a3rfa23raq23ta243wefgwe"
            "ssh_authorized_keys":
            - "github:wyrihaximus"
        EOT -> null
      - etag        = "9d62534d997bdf5ed583ea90f06ea240-1" -> null
      - id          = "config/e4:5f:01:05:41:72.yaml" -> null
      - object_name = "config/e4:5f:01:05:41:72.yaml" -> null
    }

  # module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.txt_file will be created
  + resource "minio_s3_object" "txt_file" {
      + bucket_name  = "tftp-netboot-infinity-gauntlet"
      + content      = "Lorem ipsum dolor sit amet."
      + content_type = (known after apply)
      + etag         = (known after apply)
      + id           = (known after apply)
      + object_name  = "text.txt"
      + version_id   = (known after apply)
    }

Plan: 13 to add, 1 to change, 14 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>